using System;
using System.Runtime.InteropServices;
using System.ComponentModel;
using System.Media;

namespace spooki_bar
{
#if WINDOWS || XBOX
    static class Program
    {

        static void Main(string[] args)
        {

            using (Game1 game = new Game1())
            {
                game.Run();
            }
        }

        //טעינה
        //התחברות
        //תפריט
        //משחק חדש
        //המשך משחק
        //נייגטמר
        //חדר 360
        //אור בצדדים
        //מוניטור
        //חדרים
        //אפקטים של מוניטור
        //מוב דוגמא
        //תנוע בין חדרים
        //אפקט מעבר
        //צעדים בסיסים סאונד
        //סאונד משחק בסיסי
        //סאונד משחק במשחק
        //אלגוריתם זמן
        //בטרייה
        //איפוס משחק
        //תבנית משתמש
        //הגדרות ממסד נתונים
        //דף בסיסי להצגת מידע משתמש
        //הגדרות סיום משחק
        //חסימת תגובת משתמש כמשחק לא בפוקוס, הערה בזמן שמשחק מתנהל המוניטור והחדר משחק הראשי לא יתעדכנו בכלל אבל המובים כן יזוזו
        //מסך שחור בחוס פוקוס

        //להדיר את כל החדרים
        //להגדיר מובים
        //להגדיק תנועה של מובים בחדרים
        //משתמשים עם ווב סביס
        //כל החלונות
        //חנות
        //שימוש בחפצים של החנות
        //הגדרת מיקום סאונד בכל חדר
        //הגדרת חוזק סאונד בכל חדר
        //הגדרות מוב למצלמה
        //חסימת מובים
        //חדר מיוחד
        //סיום משחק
        //אפקטים וויזואלים
    }
#endif
}

